In [1]:
import pandas as pd
import numpy as np

In [3]:
dict1={'Name': ['Ramesh','Suresh','Sathish',np.nan],
       'Age' : [30,33,np.nan,36],
       'City': [np.nan,'Hyd','Hyd','Blr']}

In [5]:
data=pd.DataFrame(dict1)
data

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  Hyd
2  Sathish   NaN  Hyd
3      NaN  36.0  Blr

In [12]:
data.to_csv('data1.csv',index=False)
data

      Name   Age City
0   Ramesh  30.0  NaN
1   Suresh  33.0  Hyd
2  Sathish   NaN  Hyd
3      NaN  36.0  Blr

**isnull**

In [10]:
data.isnull()

    Name    Age   City
0  False  False   True
1  False  False  False
2  False   True  False
3   True  False  False

In [14]:
data.isnull().sum()

Name    1
Age     1
City    1
dtype: int64

**dropna**

- drop the null values data based on rows and columns

In [17]:
# I want to extract the data with out Null values
data.dropna()

     Name   Age City
1  Suresh  33.0  Hyd

In [19]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [23]:
dict1={'Name': ['Ramesh','Suresh','Sathish',np.nan],
       'Age' : [30,33,np.nan,36],
       'City': [np.nan,'Hyd','Hyd','Blr'],
      'Company':['Google','Microsoft','Apple','Meta']}
data1=pd.DataFrame(dict1)
data1

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish   NaN  Hyd      Apple
3      NaN  36.0  Blr       Meta

In [31]:
data1.fillna(30)

      Name   Age City    Company
0   Ramesh  30.0   30     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  30.0  Hyd      Apple
3       30  36.0  Blr       Meta

In [33]:
# first select teh column 
# 
data1['Name'].fillna('Manish')

0     Ramesh
1     Suresh
2    Sathish
3     Manish
Name: Name, dtype: object

**Drawback: Filling with random value is not a good approach**

- To avoid that we have some methods

    - backfill

    - bfill

    - ffill

    - pad

**pad**

In [37]:
data1.fillna(method='pad')

C:\Users\HP\AppData\Local\Temp\ipykernel_4932\116358274.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data1.fillna(method='pad')

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  33.0  Hyd      Apple
3  Sathish  36.0  Blr       Meta

In [39]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='pad')

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  33.0  Hyd      Apple
3  Sathish  36.0  Blr       Meta

In [41]:
import warnings
warnings.filterwarnings('ignore')
data1.fillna(method='pad',axis=1)

      Name      Age  City    Company
0   Ramesh     30.0  30.0     Google
1   Suresh     33.0   Hyd  Microsoft
2  Sathish  Sathish   Hyd      Apple
3      NaN     36.0   Blr       Meta

In [45]:
data1.fillna(method='backfill')

      Name   Age City    Company
0   Ramesh  30.0  Hyd     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  36.0  Hyd      Apple
3      NaN  36.0  Blr       Meta

In [47]:
data1.fillna(method='bfill')

      Name   Age City    Company
0   Ramesh  30.0  Hyd     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  36.0  Hyd      Apple
3      NaN  36.0  Blr       Meta

In [49]:
data1.fillna(method='ffill')

      Name   Age City    Company
0   Ramesh  30.0  NaN     Google
1   Suresh  33.0  Hyd  Microsoft
2  Sathish  33.0  Hyd      Apple
3  Sathish  36.0  Blr       Meta

**Mean-Median-Mode**

In [52]:
# Step-1 : Select the column 
# Step-2 : Get the mean
# Step-3 : Apply fill na 

age_mean=data1['Age'].mean()
print('age_mean:',age_mean)
data1['Age'].fillna(age_mean)

age_mean: 33.0

0    30.0
1    33.0
2    33.0
3    36.0
Name: Age, dtype: float64

In [56]:
age_mean # Fixed value

33.0

In [62]:
city_mode=data1['City'].mode()
print('city_mode:',city_mode)
data1['City'].fillna(city_mode)

city_mode: 0    Hyd
Name: City, dtype: object

0    Hyd
1    Hyd
2    Hyd
3    Blr
Name: City, dtype: object

In [64]:
city_mode # Series

0    Hyd
Name: City, dtype: object

In [66]:
import numpy as np
from sklearn.impute import KNNImputer
X=[[1,2,np.nan], [3,np.nan,3], [np.nan,60,5],[8,8,7]]
pd.DataFrame(X)

     0     1    2
0  1.0   2.0  NaN
1  3.0   NaN  3.0
2  NaN  60.0  5.0
3  8.0   8.0  7.0

In [68]:
import numpy as np
from sklearn.impute import KNNImputer
X=[[1,2,np.nan], [3,np.nan,3], [np.nan,60,5],[8,8,7]]
pd.DataFrame(X)

array([[ 1. ,  2. ,  5. ],
       [ 3. , 31. ,  3. ],
       [ 5.5, 60. ,  5. ],
       [ 8. ,  8. ,  7. ]])